{
  "summary": "A seasoned Software Engineer with almost 7 years of industry experience. I've had the privilege of working in both back-end and front-end positions. During my journey, I've contributed to diverse projects in the defense industry in Turkey, and spent the last 2 years in the Netherlands, where I furthered my expertise at VodafoneZiggo as a backend engineer.\n\nNow, I'm thrilled to dive into frontend development more. Proficient in React, Redux, Axios, Next.js, and more. I'm eager to leverage my fast-learning capabilities and adaptability to improve myself even further.\n\nI've designed this portfolio website to showcase my skill set. Explore my collection of React components, showcasing frontend logic. Each page provides detailed insights into encountered challenges and the implemented solutions. I have recreated these components as accurately as possible, employing fictional scenarios.\n\nFeel free to reach out for any inquiries or collaborations!",
  "experienceEvents": [
    {
      "title": "VodafoneZiggo | TMC",
      "date": "February 2022 - Current",
      "location": "Maastricht/Eindhoven, The Netherlands",
      "image": "logo-tmc-vfz.png",
      "summary": "During my time at VodafoneZiggo, I actively contributed to the development of a NaaS solution as a back-end engineer, leveraging Java 8, Maven, and Amdocs' NEO platform. I independently learned and utilized the Robot Framework for API testing, ensuring the solution's reliability and seamless integration with various environments.\n\nWorking in an agile environment, I collaborated closely with teams, embracing effective communication and problem-solving to deliver successful outcomes. Using the technologies like AWS, Kubernetes, Drool rules, and Postman, I gained valuable experience in cloud infrastructure and rule-based logic. Collaborating effectively with teams, I delivered reliable results and developed a passion for frontend development."
    },
    {
      "title": "HAVELSAN",
      "date": "February 2017 - January 2022",
      "location": "Ankara, Turkey",
      "image": "logo-havelsan.png",
      "summary": "At HAVELSAN, a defense industry company, I had the privilege of contributing to diverse projects, showcasing my versatility and expertise as a fullstack engineer.\n\nIn the Big Data and AI Department, I played a key role in developing microservices for a business intelligence software utilized by the Ministry of Education. I was responsible for the development of two microservices, Workspace, and Schedule services, delivering crucial capabilities. Using technologies like MongoDB for data storage, RabbitMQ for event handling, and Swagger for code documentation, we ensured the reliability and scalability of the solution.\n\nAdditionally, I excelled as a frontend developer for the submarine sensor tracking and validating project for The Turkish NAVY, contributing my skills and dedication for the last 2 years. This project allowed me to enhance my proficiency in frontend technologies, including React, Redux, Axios, D3, and more, and offered valuable insights into creating intuitive and visually appealing user interfaces.\n\nIn the R&D Department, I contributed to the development of RESTful endpoints for the Technology Management System, an internal tool used for command control solutions in the military field. We followed a monolith structure, employing the Spring Framework, Maven, Hibernate, MySQL, and Tomcat for back-end development. On the front-end, we utilized an in-house JavaScript (ES6) framework."
    },
    {
      "title": "HAVELSAN (Internship)",
      "date": "August 2015 - September 2015",
      "location": "Ankara, Turkey",
      "image": "logo-havelsan.png",
      "summary": "During my graduation internship at HAVELSAN, I made valuable contributions to the development of a military joint capability area management software. As part of the project's inception, I played a vital role in crafting essential endpoints using Java, Spring Boot, and JPA, contributing to the software's foundation.\n\nMoreover, I honed my skills in front-end development, creating prototype screens for the software using AngularJS and Bootstrap. This hands-on experience allowed me to explore the world of modern web development and gain expertise in these technologies."
    },
    {
      "title": "TÜBİTAK (Internship)",
      "date": "June 2013 - August 2013",
      "location": "Ankara, Turkey",
      "image": "logo-tubitak.png",
      "summary": "During my first internship at TÜBİTAK, I took on the responsibility of developing a software solution for storing and managing third-party software licenses purchased by the company. Given the freedom to choose any programming language, I opted for Delphi, aiming to further enhance my proficiency in this language even tough it's a fairly old language and not popular anymore.\n\nThe result of my efforts was a successful desktop application that efficiently stored and allowed users to check the acquired software licenses. This application became an integral part of the team's workflow and was utilized to manage licenses effectively."
    }
  ],
  "educationData": [
    {
      "title": "HAVELSAN | SAP Trainee",
      "date": "October 2016 - December 2016",
      "summary": "Successfully completed training with distinction, ranking second among nearly 60 candidates."
    },
    {
      "title": "Selçuk University",
      "date": "September 2011 - June 2015",
      "summary": "Bachelor's degree in Computer Engineering. Graduated in 2015 with a GPA of 3.48/4.00, ranking second highest in the class."
    }
  ],
  "skillSetData": [
    {
      "title": "Development Languages / Technologies",
      "skills": [
        {
          "title": "Java",
          "level": "high"
        },
        {
          "title":  "JavaScript (ES6)",
          "level": "high"
        },
        {
          "title":  "React",
          "level": "high"
        },
        {
          "title":  "Spring Boot",
          "level": "high"
        },
        {
          "title":  "Redux",
          "level": "high"
        },
        {
          "title":  "Maven",
          "level": "high"
        },
        {
          "title":  "Axios",
          "level": "high"
        },
        {
          "title":  "Next.js",
          "level": "medium"
        },
        {
          "title":  "CSS",
          "level": "medium"
        },
        {
          "title":  "Chart.js",
          "level": "medium"
        },
        {
          "title":  "Robot Framework",
          "level": "medium"
        },
        {
          "title":  "Drool Rules",
          "level": "medium"
        },
        {
          "title":  "RabbitMQ",
          "level": "medium"
        },
        {
          "title":  "MongoDB",
          "level": "medium"
        },
        {
          "title":  "MySQL",
          "level": "medium"
        },
        {
          "title":  "Quartz",
          "level": "medium"
        },
        {
          "title":  "JUnit",
          "level": "medium"
        },
        {
          "title":  "JEST",
          "level": "medium"
        },
        {
          "title":  "Node.js",
          "level": "low"
        },
        {
          "title":  "Typescript",
          "level": "low"
        },
        {
          "title":  "Hibernate",
          "level": "low"
        },
        {
          "title":  "PostgreSQL",
          "level": "low"
        }
      ]
    },
    {
      "title": "Know-How",
      "skills": [
        {
          "title": "Fullstack Development",
          "level": "high"
        },
        {
          "title": "Microservices",
          "level": "high"
        },
        {
          "title": "RESTful Endpoints",
          "level": "high"
        },
        {
          "title": "Web Services",
          "level": "high"
        },
        {
          "title": "Single Page App",
          "level": "high"
        },
        {
          "title": "CRUD",
          "level": "high"
        },
        {
          "title": "Agile Methodology",
          "level": "high"
        },
        {
          "title": "SOLID",
          "level": "high"
        },
        {
          "title": "API Testing",
          "level": "medium"
        },
        {
          "title": "Unit Tests",
          "level": "medium"
        },
        {
          "title": "Charting",
          "level": "medium"
        },
        {
          "title": "DOM Manipulation",
          "level": "low"
        },
        {
          "title": "Cloud Bus",
          "level": "low"
        },
        {
          "title": "Cloud Stream",
          "level": "low"
        }
      ]
    },
    {
      "title": "Equipment / Tools",
      "skills": [
        {
          "title": "IntelliJ Idea",
          "level": "high"
        },
        {
          "title": "IntelliJ WebStorm",
          "level": "high"
        },
        {
          "title": "Postman",
          "level": "high"
        },
        {
          "title": "Swagger",
          "level": "high"
        },
        {
          "title": "SonarQube",
          "level": "medium"
        },
        {
          "title": "Linux",
          "level": "medium"
        },
        {
          "title": "Kubernetes",
          "level": "medium"
        },
        {
          "title": "Docker",
          "level": "medium"
        },
        {
          "title": "VSCode",
          "level": "low"
        },
        {
          "title": "JMeter",
          "level": "low"
        },
        {
          "title": "AWS",
          "level": "low"
        }
      ]
    },
    {
      "title": "Collaboration Tools",
      "skills": [
        {
          "title": "JIRA",
          "level": "high"
        },
        {
          "title": "GitLab",
          "level": "high"
        },
        {
          "title": "Bitbucket",
          "level": "high"
        },
        {
          "title": "Confluence",
          "level": "high"
        },
        {
          "title": "Bamboo",
          "level": "medium"
        }
      ]
    }
  ],
  "languagesData": [
    {
      "title": "English",
      "level": "Professional Working Proficiency"
    },
    {
      "title": "Turkish",
      "level": "Native Language"
    }
  ]
}